function task8(){
   // Запросите у пользователя число и сформируйте на его основе другое число, каждая цифра которого больше на единицу. 
   // Если попалась цифра 9 она также заменяется на 10. (toString(),split(“”),map)
   
let a=prompt(`Введите число `);
a=a.toString();


// toString() – преобразует элементы массива в строку
// forEach() – выполняет перебор элементов и выполняет с ними определенный операции.
// В качестве параметра принимает функцию, которая имеет один параметр - текущий перебираемый элемент массива.
// numbers.forEach(n => console.log("Квадрат числа", n, "равен", n * n ));
// map() - похож на метод forEach, он также в качестве параметра принимает функцию, с помощью 
//которой выполняются операции над перебираемыми элементами массива,
//  но при этом возвращает новый массив с результатами операций над элементами массива


}